DailyNoBug/MCTRL/stm32g431rbt6.svd
            <register>
               <name>IPR7</name>
               <displayName>IPR7</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x31C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR8</name>
               <displayName>IPR8</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x320</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR9</name>
               <displayName>IPR9</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x324</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR10</name>
               <displayName>IPR10</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x328</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR11</name>
               <displayName>IPR11</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x32C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR12</name>
               <displayName>IPR12</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x330</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR13</name>
               <displayName>IPR13</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x334</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR14</name>
               <displayName>IPR14</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x338</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR15</name>
               <displayName>IPR15</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x33C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR16</name>
               <displayName>IPR16</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x340</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR17</name>
               <displayName>IPR17</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x344</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR18</name>
               <displayName>IPR18</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x348</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR19</name>
               <displayName>IPR19</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x34C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR20</name>
               <displayName>IPR20</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x350</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR21</name>
               <displayName>IPR21</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x354</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>IPR22</name>
               <displayName>IPR22</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x358</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>IPR23</name>
               <displayName>IPR23</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x35C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>IPR24</name>
               <displayName>IPR24</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x360</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>IPR25</name>
               <displayName>IPR25</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x364</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
            </register>
           <register>
               <name>STIR</name>
               <displayName>STIR</displayName>
               <description>Software trigger interrupt register</description>
               <addressOffset>0xE00</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>Software generated interrupt               ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
          </register>
